In [1]:
import pandas as pd; import numpy as np; import janitor as jn

In [2]:
pd.__version__

'2.2.1'

In [3]:
events = pd.read_csv('/Users/samuel.oranyeli/Downloads/results.csv', parse_dates=['start','end']).iloc[:, 1:]

In [4]:
events.dtypes

id                   int64
name                object
audience             int64
start       datetime64[ns]
sponsor             object
end         datetime64[ns]
dtype: object

In [5]:
a = (events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = True,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

a

OMP: Info #276: omp_set_nested routine deprecated, please use omp_set_max_active_levels instead.

        left                                          right  \
          id               start                 end     id
0          1 2022-11-19 10:00:00 2022-11-19 10:15:00      1
1          2 2015-09-27 15:00:00 2015-09-27 15:11:00      2
2          3 2019-11-12 18:00:00 2019-11-12 18:53:00      3
3          4 2019-12-24 22:00:00 2019-12-24 22:11:00      4
4          5 2028-06-20 12:00:00 2028-06-20 12:31:00      5
...      ...                 ...                 ...    ...
33696  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296
33697  29996 2007-06-16 13:00:00 2007-06-16 13:12:00  29996
33698  29997 2026-02-25 22:00:00 2026-02-25 22:43:00  29997
33699  29998 1992-03-08 22:00:00 1992-03-08 22:48:00  29998
33700  29999 2006-01-01 05:00:00 2006-01-01 05:52:00  29999


                    start                 end
0     2022-11-19 10:00:00 2022-11-19 10:15:00
1     2015-09-27 15:00:00 2015-09-27 15:11:00
2     2019-11-12 18:00:00 2019-11-12 18:53:00
3     2019-12-24 22:00:00 2019-12-24 22:11:00
4     2028-06-20 12:00:00 2028-06-20 12:31:00
...                   ...                 ...
33696 2016-09-04 14:00:00 2016-09-04 14:50:00
33697 2007-06-16 13:00:00 2007-06-16 13:12:00
33698 2026-02-25 22:00:00 2026-02-25 22:43:00
33699 1992-03-08 22:00:00 1992-03-08 22:48:00
33700 2006-01-01 05:00:00 2006-01-01 05:52:00

[33701 rows x 6 columns]

In [6]:
%%timeit
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = True,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

19.2 ms ± 48.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [7]:
%%timeit
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = False,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

18.7 ms ± 141 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [8]:
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = False,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

       left                                          right  \
         id               start                 end     id
0        10 1993-11-27 12:00:00 1993-11-27 12:37:00   2345
1        15 1993-04-04 16:00:00 1993-04-04 18:00:00  11178
2        17 2030-10-25 07:00:00 2030-10-25 07:27:00  19605
3        26 2005-10-04 17:00:00 2005-10-04 17:18:00   8218
4        35 2024-05-02 15:00:00 2024-05-02 15:35:00   6916
...     ...                 ...                 ...    ...
3697  29966 2000-08-26 11:00:00 2000-08-26 13:00:00  29375
3698  29971 2018-05-18 04:00:00 2018-05-18 04:18:00  24173
3699  29978 1992-06-07 22:00:00 1992-06-07 22:23:00    981
3700  29984 2025-06-05 03:00:00 2025-06-05 03:17:00  19051
3701  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296


                   start                 end
0    1993-11-27 10:00:00 1993-11-27 12:00:00
1    1993-04-04 17:00:00 1993-04-04 17:22:00
2    2030-10-25 06:00:00 2030-10-25 08:00:00
3    2005-10-04 17:00:00 2005-10-04 17:27:00
4    2024-05-02 15:00:00 2024-05-02 15:36:00
...                  ...                 ...
3697 2000-08-26 13:00:00 2000-08-26 13:53:00
3698 2018-05-18 04:00:00 2018-05-18 04:36:00
3699 1992-06-07 22:00:00 1992-06-07 22:30:00
3700 2025-06-05 01:00:00 2025-06-05 03:00:00
3701 2016-09-04 14:00:00 2016-09-04 14:50:00

[3702 rows x 6 columns]

In [9]:
# # %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '>='),
#     ('end', 'start', '<='),
#     ('id', 'id', '!='),
#     # ('audience','audience','>'),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [10]:
C=dict(key=[f"c{num}" for num in range(1,8)],
       vol=[35,15,5,35,18,90,17],
       profit=[45,35,55,12,15,55,11],
       unitsSold=[15,10,30,10,15,80,2],
       keyy = range(1,8)
       )
C=pd.DataFrame(C)


D=dict(key=[f'd{num}' for num in range(1,9)],
       vol=[20,50,15,16,40,20,40,2],
       profit=[30,10,12,52,35,20,30,57],
       unitsSold=[20,35,10,12,40,30,5,15],
       keyy=range(8,0,-1)
       )
D=pd.DataFrame(D)

In [11]:
# C = pd.concat([C]*40*40)
# D = pd.concat([D]*40*40)

In [12]:
(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    # ('keyy','keyy','=='),
  # ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=True)
)

   left                           right
    key vol profit unitsSold keyy   key vol profit unitsSold keyy
0    c3   5     55        30    3    d3  15     12        10    6
1    c3   5     55        30    3    d4  16     52        12    5
2    c3   5     55        30    3    d1  20     30        20    8
3    c3   5     55        30    3    d6  20     20        30    3
4    c3   5     55        30    3    d2  50     10        35    7
5    c3   5     55        30    3    d5  40     35        40    4
6    c3   5     55        30    3    d7  40     30         5    2
7    c1  35     45        15    1    d2  50     10        35    7
8    c1  35     45        15    1    d5  40     35        40    4
9    c1  35     45        15    1    d7  40     30         5    2
10   c2  15     35        10    2    d3  15     12        10    6
11   c2  15     35        10    2    d1  20     30        20    8
12   c2  15     35        10    2    d6  20     20        30    3
13   c2  15     35        10    2    d2  50     10        35    7
14   c2  15     35        10    2    d5  40     35        40    4
15   c2  15     35        10    2    d7  40     30         5    2
16   c4  35     12        10    4    d2  50     10        35    7
17   c5  18     15        15    5    d2  50     10        35    7
18   c7  17     11         2    7    d2  50     10        35    7

In [13]:
(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    # ('keyy','keyy','=='),
  # ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=False)
)

   left                           right
    key vol profit unitsSold keyy   key vol profit unitsSold keyy
0    c1  35     45        15    1    d2  50     10        35    7
1    c1  35     45        15    1    d7  40     30         5    2
2    c1  35     45        15    1    d5  40     35        40    4
3    c2  15     35        10    2    d2  50     10        35    7
4    c2  15     35        10    2    d3  15     12        10    6
5    c2  15     35        10    2    d6  20     20        30    3
6    c2  15     35        10    2    d1  20     30        20    8
7    c2  15     35        10    2    d7  40     30         5    2
8    c2  15     35        10    2    d5  40     35        40    4
9    c3   5     55        30    3    d2  50     10        35    7
10   c3   5     55        30    3    d3  15     12        10    6
11   c3   5     55        30    3    d6  20     20        30    3
12   c3   5     55        30    3    d1  20     30        20    8
13   c3   5     55        30    3    d7  40     30         5    2
14   c3   5     55        30    3    d5  40     35        40    4
15   c3   5     55        30    3    d4  16     52        12    5
16   c4  35     12        10    4    d2  50     10        35    7
17   c5  18     15        15    5    d2  50     10        35    7
18   c7  17     11         2    7    d2  50     10        35    7

In [14]:
# %%timeit
# (C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#   # ('unitsSold','unitsSold','>='),
#   ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=True)
# )

In [15]:
# %%timeit
# (C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#   # ('unitsSold','unitsSold','>='),
#   ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=False)
# )

In [16]:
C

  key  vol  profit  unitsSold  keyy
0  c1   35      45         15     1
1  c2   15      35         10     2
2  c3    5      55         30     3
3  c4   35      12         10     4
4  c5   18      15         15     5
5  c6   90      55         80     6
6  c7   17      11          2     7

In [17]:
D.sort_values('profit')

  key  vol  profit  unitsSold  keyy
1  d2   50      10         35     7
2  d3   15      12         10     6
5  d6   20      20         30     3
0  d1   20      30         20     8
6  d7   40      30          5     2
4  d5   40      35         40     4
3  d4   16      52         12     5
7  d8    2      57         15     1

In [18]:
D.sort_values('vol')

  key  vol  profit  unitsSold  keyy
7  d8    2      57         15     1
2  d3   15      12         10     6
3  d4   16      52         12     5
0  d1   20      30         20     8
5  d6   20      20         30     3
4  d5   40      35         40     4
6  d7   40      30          5     2
1  d2   50      10         35     7

In [19]:
# %%timeit
# (C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#   # ('unitsSold','unitsSold','>='),
#   ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=False)
# )

In [20]:
C

  key  vol  profit  unitsSold  keyy
0  c1   35      45         15     1
1  c2   15      35         10     2
2  c3    5      55         30     3
3  c4   35      12         10     4
4  c5   18      15         15     5
5  c6   90      55         80     6
6  c7   17      11          2     7

In [21]:
D.sort_values('profit')

  key  vol  profit  unitsSold  keyy
1  d2   50      10         35     7
2  d3   15      12         10     6
5  d6   20      20         30     3
0  d1   20      30         20     8
6  d7   40      30          5     2
4  d5   40      35         40     4
3  d4   16      52         12     5
7  d8    2      57         15     1

In [22]:
# f=(C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#    ('unitsSold','unitsSold','>='),
#  # ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=True)
# )
# f

In [23]:
# from string import ascii_lowercase
# np.random.seed(1)
# n = 20; k = 20
# # n = 20_000_000; k = 20_000
# mapp = {k:v for v,k in enumerate(ascii_lowercase)}
# idx1 = np.random.randint(0, high = 2_00, size = n)
# idx2 = np.random.randint(0, high = 3_00, size = n)

# d1 = dict(x = np.random.choice(list(ascii_lowercase[:5]), size=n),
#           start = np.minimum(idx1, idx2),
#           end = np.maximum(idx1, idx2),
#           )


# d2 = dict(x = np.random.choice(list(ascii_lowercase[:15]), size=k),
#           pos1 = np.random.randint(low=60, high = 151, size=k))

# d1 = pd.DataFrame(d1)
# d2 = pd.DataFrame(d2)
# d1 = d1.assign(xx=lambda df: df.x.map(mapp))
# d2 = d2.assign(xx=lambda df: df.x.map(mapp))

In [24]:
# bla = (d2
# .conditional_join(
#     d1, 
#     ('pos1', 'start', '>'), 
#      ('pos1', 'end', '<'), 
#    # ('xx', 'xx', '=='), 
#     use_numba=True)
# )

# bla

In [25]:
x=np.array([6, 6, 6, 6, 2, 4, 5, 6, 5, 6, 5, 6, 6, 6, 5, 1, 6, 6, 3])
x

array([6, 6, 6, 6, 2, 4, 5, 6, 5, 6, 5, 6, 6, 6, 5, 1, 6, 6, 3])

In [26]:
np.partition(bla[1],248842-248212)[248842-248212:]

NameError: name 'bla' is not defined

In [ ]:
%timeit bla[1][np.argpartition(bla[1],248842-248212)[248842-248212:]]

In [ ]:
%timeit bla[1][bla[1]>=91]

In [ ]:
bla[1][bla[1]>=91]

In [ ]:
%timeit x[x>=6]

In [ ]:
np.partition(x,7)

In [ ]:
%timeit x[np.argpartition(x,7)[8:]]

In [ ]:
%timeit x[np.argpartition(x,7)]

In [ ]:
len([3, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6])

In [ ]:
np.searchsorted([3, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6], 1)

In [ ]:
bla[3].size

In [ ]:
(bla[5][:2410367]>=91).sum()

In [ ]:
%timeit bla[5][:2410367][bla[5][:2410367]>=91]

In [ ]:
%timeit np.sort(bla[1][97:97+14458])

In [ ]:
pd.unique(bla[5])

In [ ]:
bla[1].size

In [ ]:
uniques = pd.factorize(bla[5],sort=True)[1]
uniques

In [ ]:
%timeit uniques.searchsorted(91)

In [ ]:
%timeit uniques.searchsorted(bla[5][:2410367])

In [ ]:
pd.unique(pd.factorize(bla[1],sort=True)[0])